
Процедура ПередЗаписью(Отказ)
	
	Если ДополнительныеСвойства.Свойство("НазначитьПоУмолчанию") И ДополнительныеСвойства.НазначитьПоУмолчанию=Истина Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КафкаКластеры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КафкаКластеры КАК КафкаКластеры
		|ГДЕ
		|	КафкаКластеры.ИмяПредопределенныхДанных = ""ПоУмолчанию""
		|	И КафкаКластеры.Ссылка <> &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		ПредТЗ = Запрос.Выполнить().Выгрузить();
		Для Каждого ПредС Из ПредТЗ Цикл
			ПредОбъект = ПредС.Ссылка.ПолучитьОбъект();
			ПредОбъект.ИмяПредопределенныхДанных = "";
			ПредОбъект.Записать();
		КонецЦикла;
		
		ИмяПредопределенныхДанных = "ПоУмолчанию";
		
	КонецЕсли;
	
	Для Каждого С Из КафкаКонфигурация Цикл
		С.Параметр = СокрЛП(НРег(С.Параметр));
	КонецЦикла;
	
КонецПроцедуры
