
Функция ЭтоБэкап() Экспорт
	
	Возврат Ложь;
	
КонецФункции

Функция РазрешенОбменБэкапов() Экспорт
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьОбработку(Шина) Экспорт
	
	Возврат Обработки[Шина.Обработка].Создать();
		
КонецФункции

Функция ГруппаПолучателей() Экспорт
	
	Возврат ИдентификаторИнформационнойБазы();
	
КонецФункции

Функция API() Экспорт
	
	Возврат Обработки.КафкаAPI.Создать();
	
КонецФункции

Функция РазрешеноНесколькоКластеров() Экспорт
	
	Возврат Ложь;
	
КонецФункции

Функция ПользовательПоУмолчанию() Экспорт
	
	Возврат ИдентификаторИнформационнойБазы();
	
КонецФункции

Функция ИдентификаторИнформационнойБазы() Экспорт
	
	СтрокаСоединения = НРег(СтрокаСоединенияИнформационнойБазы());
	ИмяИБ = СокрЛП(НСтр(СтрокаСоединения, "ref"));
	ИмяКластера = СокрЛП(НСтр(СтрокаСоединения, "srvr"));
	Возврат ИмяИБ + "@" + ИмяКластера;
	
КонецФункции
