
Функция ЭтоБэкап() Экспорт
		
	Возврат Ложь;
	
КонецФункции

Функция РазрешенОбменБэкапов() Экспорт
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьОбработку(Шина) Экспорт
	
	Возврат Обработки[Шина.Обработка].Создать();
		
КонецФункции

Функция ГруппаПолучателей() Экспорт
	
	Возврат ИдентификаторИнформационнойБазы();
	
КонецФункции

Функция Адаптер() Экспорт
	
	Возврат Обработки.КафкаАдаптер.Создать();
	
КонецФункции

Функция ПользовательПоУмолчанию() Экспорт
	
	Возврат ИдентификаторИнформационнойБазы();
	
КонецФункции

Функция ИдентификаторИнформационнойБазы() Экспорт
	
	СтрокаСоединения = НРег(КафкаПовтИсп.СтрокаСоединенияИБ());
	
	ИмяИБ = СокрЛП(НСтр(СтрокаСоединения, "ref"));
	ИмяКластера = СокрЛП(НСтр(СтрокаСоединения, "srvr"));
	
	Если ИмяКластера = "" Тогда
		Возврат ИмяИБ;
	Иначе
		Возврат ИмяИБ + "@" + ИмяКластера;
	КонецЕсли;
	
КонецФункции

Функция ИмяИнформационнойБазы() Экспорт
	
	СтрокаСоединения = НРег(КафкаПовтИсп.СтрокаСоединенияИБ());
	Возврат СокрЛП(НСтр(СтрокаСоединения, "ref"));
	
КонецФункции
